In [3]:
import pandas as pd
df1 = pd.DataFrame({
    "city": ["new york", "chicago", "baltimore"],
    "temperature" : [21,14,32],
}) 
df1

        city  temperature
0   new york           21
1    chicago           14
2  baltimore           32

In [4]:
df2 = pd.DataFrame({
    "city": ["chicago", "new york", "orland","san francisco"],
    "humidity" : [65,68,75,71],
})
df2

            city  humidity
0        chicago        65
1       new york        68
2         orland        75
3  san francisco        71

In [12]:
df3 = pd.merge(df1,df2,on="city",how="outer",indicator=True)
df3

            city  temperature  humidity      _merge
0       new york         21.0      68.0        both
1        chicago         14.0      65.0        both
2      baltimore         32.0       NaN   left_only
3         orland          NaN      75.0  right_only
4  san francisco          NaN      71.0  right_only

In [20]:
df1 = pd.DataFrame({
    "city": ["new york", "chicago", "baltimore"],
    "temperature" : [21,14,32],
    "humidity" : [65,68,71]

}) 
df1

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2  baltimore           32        71

In [21]:
df2 = pd.DataFrame({
    "city": ["new york", "chicago", "orland"],
    "temperature" : [21,14,32],
    "humidity" : [65,68,71]
}) 
df2

       city  temperature  humidity
0  new york           21        65
1   chicago           14        68
2    orland           32        71

In [23]:
df3 = pd.merge(df1,df2,on="city",suffixes=('_left','_right'))
df3

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,new york,21,65,21,65
1,chicago,14,68,14,68